[M_Sage_NotSoFriendly MissionDefinition]
MissionName="humanity"
MissionDescription="Claptrap befriends many animals that he likes You want to know how things are going and you are angry."
TurnInDescription="If you want to end a friendship, it's best to do it with medication."
MissionSummary="Help Claptrap and his forest friends.."
MissionGiver="Rock Forest Awards Committee"
MissionTurnInLocation="Shila Jubilee Award Committee"
TeaserText="Friends forever!"

[M_Sage_NotSoFriendly:DestroyVillage1 MissionObjectiveDefinition]
ProgressMessage="Chapter 1 is repealed."

[M_Sage_NotSoFriendly:DestroyVillage2 MissionObjectiveDefinition]
ProgressMessage="Both cities were destroyed."

[M_Sage_NotSoFriendly:DestroyVillage2Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_NotSoFriendly:DestroyVillageSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Destroy the city"
MissionDescriptionOverride="Claptrap makes friends with other animals who love him. He wants you to see what he does and how much he respects you..<br>After visiting the wild animals and realizing that they don't know Claptrap, the Dancing Robots are angry and want to kill them.."

[M_Sage_NotSoFriendly:FinalSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_NotSoFriendly:GotoVillage MissionObjectiveDefinition]
ProgressMessage="To the city of Pirat."

[M_Sage_NotSoFriendly:GotoVillageSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

